{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ],
        [
          "qp_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              68,
              68,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "init_conv",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "init_conv"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_1",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "init_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_2"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_2"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_2",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_3"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_4"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_4"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_3",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_5"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_6"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_6"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_4",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_4"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              1
            ],
            "dtype": "float32",
            "name": "qp_input",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "qp_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "dtype": "float32",
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "qp_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "sigmoid",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "fc480",
            "trainable": true,
            "units": 480,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "fc480"
        }
      ],
      "name": "archiGlobal",
      "output_layers": [
        [
          "fc480",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.9.0"
  },
  "hash": "1829eec173ba3bb8708bd529e34d1d9c928770688777eff4a0e245f7d391a000",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      68,
      68,
      1
    ],
    [
      1
    ]
  ],
  "output_shapes": [
    [
      480
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            68,
            68,
            1
          ],
          "values": [
            "erCEOmd31D6hXb6/B1eoPuNuaL+dVA4/1ECnP/lYD0BLFw49dU5lPwcmlr8v3yq/ZYe7PRZpST8OszI/+D7dvoNGZb/3KII/BiGdvznWm7+346+/d+E7vzqmF74ipTM/NDN9P7fhQj/Q6ArAD4TCvjdLlL14IMA9VX5kPvlLzr/+Cyq/1zoHPj4iF79SEhM/NCK/vo2+E7+fsVg/lbjGvieNUz8yVv2+qryFPk8h9b/eNWC/le8ewP3XYz8xlSQ/g+7/PQud1r+GDpU+M9mfP9ANs79Pdwe/MuOCv7Jqbz+TYS4/O7bUP+oV+D5TRD4/x4DBvU2vW77efK4+eu0Bv5C3E76eahQ/+lEYPyorqr+VkWU8xyErQMoF1T+F2oA+AzkdQOjisz8SLXC/24eXv1CwPL84BVU+qeYhQCgTxT+7/8U/gD35P6Y2nb+hRFS/7eUKQPG3cr9NhY++N1a3P6JYB0B2+Vu+ahNEv17CuD7a+gq9V2uEvlRag76OfO0+6cJDvglooz83iuE/z9QlwAjIF77Uba8+iIqcP8/rK8BUD0m+95GlP8XTzj6lfIS/s0PrPkFXkD5OOyRAWyXLPteHJ78UBVA+4FfSv6XQHcAZebM/MpWkPiChF79DqKs/MPtnP2yacT8Gm/g+aiJ7P3pvBT/deby/rfMuP/Aobz/eM7c/cmTCP3S/r7+8YnG/8riCvyIgIkB3ipM/V7HIv4mdET8eHxdAtAWHPSMpSb8EC+K+9QSyv5n5EcClZ9u+23lCPpSfZL/vqAs/j6FAv1d2eL/7Iwe/FPM/vyZbkL//J7I/twGHPzHAor9nQa0/49m2P24p7T+G12s+4urxPTL3+D76BLE/3kETP3T7lj+ij9u/fi/qvmbnjj4HAJU9J1SGv0u5Ez7tStY+qO1XP+OsIr+XeKA/2o5Hv1pSzj/MrA8//aEivQHiDz/dPhC/m17JvyGci74YhKe8+7PuPwB0Cj8IMgK/h1FvPp42MMByMSo+/8dYP8N8cz8q3w7A",
            "yiutv6V/lT9mFik/GV0EwMstYr8+9P2+lEEvv6gqIL/NYL2/76e0PqQvSD+2/h+/qiFGPyI3AT8nGq8/rMSEvzKy7T8/A8C+jY1gPzWtBr9W248/ITYFv2CHAj76sz6/rPW/vRxmxr87fxu/xCRuv2trhb64/AW/2uqCPy1MvL9X2Qm/bgPlvu74pL+maU893Hz8vZWxET/I56O/6fd6Pm9nqL/4apE/BAzavShwD76/V+2/BCpPP1rSdb5mF9E9m1bFvfHk+b6uMzU+oQ9svnrAiD+TZ7w/FHbbPy2pN79G6Zo+nL1PPs1zcb9xcro9HME1vwaQgD8+eV2/cl3gv+msoD9/S1i/jHezv6OLiL4Kzds/9l4Tvov2iT8G8wA/4zARv1TKDz+sd5O/SO4Dv/Tut73pGOs/pY5Sv9evwj+owwk/csGcP4tsr7/UxJI+1U4SQGB6lz0OpYm+EczWPv2GZb/kYbC+d/EGwMaDjL6Y5nS/BoW5v72ibL8+A+2+mG+2PpJ2eL2O25s/We/IP+6uKb6bTBfAJpqVPyvtsL67Fp++GUuCPwcyFT5BnAHAI46+v3iTPj691Uk+tsY5v2rQIb9Cyx4/AaeZP3QkrL+6pTq/L+UPPzaMCTxui3g/gmxPv3FL87/JezK/4iOev9OCjz6o48Y/xncbPZME3L9ki4C/broav+95EsBJs9g/NyaJvulX+j97p7I/6bnFv1MIGr+8nIk/MJhGvB5Bdb7PNh6/SqSzvaqJp7956pS/rhsnQNnDg7/WvqU9J6NkPy43Dj5REpo+a33VvZNr0r42qh+/iDP5P7IJVj+Clia/wBKXv3DdYL0AJJa9fgQpvzg4N78Fquo/ta3RP5Oa3L/h1Ru/2EKwvjNZE0AaunW/sL2EP8kAqj9Lm+O97+tVv8A9nD8c0Ze/ciFCP+Gi6T+xnj6/H3wzPyhgBz8BiYU9ninyPs+AZb863RO+96X9PgZXo72P+cs/t/GUP8z+W77ODqc/hGYjPp7u/T+kOP08",
            "0vO1vDQAjL4umuA+Y/+PP7T8Hb32KHa/0OcjP39M6L+ePJ6/yuGXP3FXmD+76uu+ooUkP7QPnbxWsti/gzA8QE29XD7+QKe+5IkPPwLR9L4h6O4+8Fdcvhje4L/mlpw/glOAvjXVBD8mm5+/36GuPmG7fD8QkU++iDZbvwZuMr9KSEo/hRuXO+aNxz4fdLi/QgCCPytzUb8ki4M+W8UpP5u4ab+69t0/1py2v1vjpD5nQf4/EzHAPoSWFD41vW6/0JfMvYw9c7/Rhsw/SKabv84sCr+snCq/Ln7XPCx2l77XAaW9oO8wvt8M6r76R50/cB0xP3lE2b5bJ40/SxWbv065Sz9HvDU/bGcTQLsODz4+gLY+vc27vgjKDz/+5tg/VhIOv+LCjbzMa76+BZuGv8bvrj9Ou2+/AMJ3v4DCNb87coI/4RANv/cLXb8eP3G/IS7yvaBVw7yqs4w+aHrsPb6Z1r5A57S+jr+nP6FokD/gne4/oYF0v6QqDT85Xs89Iwmtv+J6LT15XQ8+XUkOwNGflT1Ub9E/GsKuvjCByj7DSK6/nMjrvmY9lL8d1hG/BwTUPxBFnz9NeZe+WB6+PzxVTz/yqb2+C3ZSP/jMhj/4GpM/TNPbvQhStL4Uq/a/TQa1PnaUK7+4JoI+Kz39PZwu5z/Lpf8/Iks+v2dDG7+wju8+qWcPPn6T4r7fx5i/NlI7PtqyU0DhzAhALOpzv3+evz4bX3Y+Tw0CvoLaAr/igIi/TQo/v6nUBj/5kde9hYOTvv12pj4B6fU+htiMPzKBVz/yZsm+ARsVvxa5Vb75MxS/uq8cvjBJzD/zWVq+A98hv7WIRj8sShM/3gFpP6Qg7r52qK6+JtOsv0jgyz7Kw4E9MRICwJLXu78uPD0/6u6WvlcfrD4y8RtAYGk1vo+07b0r5nW/IQ/jvvbzXL/qz/Q+WaoFv4gL476jRdS9vIj1P0Qniz5i8t6+ra76vQxP3z9Do5o94yO/PekbBT8hrQW+DjB5P0AkFj/HUWu/",
            "Os5nvq15oz8+TI6/VdOWvxxqhj+MBXk+jrvnPHHkfz3u4YM+wXLjPzhboj7+79w/prMkv9BjhT5vEwa/znAIP2s127+M8Da/c7Ofv2S6Wb84uBm/A2QwP/PdmL2Drjg96toIPt40mz0tmoG/3VWYv1Negz74vBU/su8jPnwNwT/F1rm/jWI5P+5u+L/rnWg/uB9RPzVYUUBsr4Q9lzMJv26neT1dXPi+o97kPgzZSD7VqG4/wWJzvy84Pz9Jn1m9ozgvPxDP0b/BGss++zgQQCQVV763cwe+mqYTPicHWj8y45G/AoHlv8CwqL+qwjg/qNQfvBAuoz9BESK/qsIbwDGqyz+DrKa/K7U2v06FAEBSfX+/ov65PTDWlr/qGMc+FSfDv6VFXz/RAnS/zg6nP+L7HL4tZz++YXGJPHBaeD5BSBU/GmebPuBl9L6tVQ+8wiw8PpgSkb7rjlE/vlQBvko9AD6/3fk+FTIIwIUv0r7wIYC/2rCUvwglxb9qxQU95Y44vwJ0iT2jpUU/0E+Nv0d9qj3J8ZS9X6qTv+S7Zb+6pRy/FE+eP9iTHL/TOqW/i1Mlv5uH+L1SRfe/OGl7v9ab5b72ISa+vBUPPwWAA76a5Mk+9s25vl7rw74x6YE/NUsZP3t8FT8jsh4/SJ8+P/R/VL7iFgQ+4yqJPxRWmD5PSg29HORCv8jeOL9RWeQ+yVjOP1kKqD5lW4g/r4c5P3DCmb3PlLg+41d2P9IFVr+2CpO/2EQfvwzPyz4e7aI9wiYSv9Dujz+KZVw+kXCuPpNQk7/dzwNANnXePwkRKb8/sRS+XStjPw8qrT/74m+/Lrb8O+a1XD/ELPM9ycEFPzgnhD8kBgLA8Y6MP6TaBT5T6M6+c5VBP/+Klz/N95+/afS7Ppi9/D/Y0U0+HhyMPVbLN75FFyQ/jjigP5rw5L6GoBBAvE+HvpsGkT9Mu5O/ZmKMv0FYPT+1vVM+rMF8PuDsyD93UXI/Kyopv4KWpj4iLr09ob7Mv4AiVD5bBpu+",
            "ANUAP2TZGz8nZPy+2CjwvtmjET/yxfo/2JZbv1+Toj4I46S/eLDDP3Ukmb9gU9u+U4I3v6fJrz59oY6/uq4SP9Teir/P5PG/GF2/vs2EmL9Btzo9rxAhwOu5Sj90pT++4irKvkV8RcAxyXq/MMwoP0I21b780o4+QxkbP3HY4z/9LoW/HbZzP+Y+rL/lrzO/zFijP6ooC79Txqa/Ccpsv5fBMD/OQyS+rWjwPpv8Kr8+8Ki/92QnP742z76T0sa9uy6qvj+9PL5B1Fa+8XDVPpZ6F7/n3y1A0lG7Pj8WoL+jtIS+8bSmPzQS+b76blY/PaJ4v0sblL8p3a6/C+7OP925RT/XrYs9vHqCvWsCvz798/A9uI3bv/Tl3L7/YOa9lSMEQEuzFb9M0ZY/diegPsS+wj5A7qS/ZBmsP69G3D9Qg/4+zdjVvSCZrz5okzC/Zc+Cv0P6yL9yH5O/Ztgkv9V3Xb9y/Tg9aCazv2MVfr9vfho/MVmlP0ANL792urg/q2JbvwbFsT+iacg+kC0aP1AuLj95EqG/GmVjP4VwaL9UKDs+3jg3P/jDLb/vVPE84u9CPs0cK78YRqc+xMOUvh5/VL8tg6q95lWCv240vD8w64e/hNVbv6qTj78pcoY/AxwVP5Joij9X37M+X+x4v39zD7+GT8G/vVStPuCBnb5uxYM/SybNPy9UR79rNJs+Bby4v/TNAb+lBn0/TAlav+Bulz9HbfQ9drPFPoONVr/QCA8/IyaMP8T5oL/KFJG8RgDQvrMtfj8OFDk//6+4vgdnp78lE4S/ZvUMP9pDXz+Re5s/OOjrvGg/cz9LVJ6/rZamP+laKL82jDg/RTtWP2OKHT+VZkQ/Y+abPfXABr/lkJI++kP6v4lxiz6I40K/RsAVP6RoC0Cb85S+tCt7v8rLCsCjzV+/IsuxvtsDWz+O44C//f7YP0mFbD9hPLY/JcJwP9CKZj6piPI/y77fP+IaXT/jE3C/+TJnP4BSUz6vYpU/ST0qPytnYj5uP3w/",
            "u4PBv3abrr95aIO/nicVPH0zYb5b0pM+Ob8rwDQ1Lj6kxK2/HeIkPzrkCcBoqK8+XutiPtUntD9h7jE+8oUWvxyT5L5vP5I/cKCTPldD0z5YGB6/nIKNPc5Elz3qyZe/xGrmPoTbET9vOJk/VoSuPzLwCr/D8UpAIo+/PtUO3L669Wy/rwo7vzq5eT6R+IO+SF24P6r6OD9ubMk+znoGPqFvIz+GrQY/p6SvvWSYML+EsXa/M9pNPrEYcb/GKoi/5k/5P2EFGT8KL52/M9lDP7AjdD/u2Za/+vQJPzAF979fqfG+tCv3vhlVjT9Ub4u/NNPtP/Cbcb7EZcY88jyrP1ZW571QSJW+lTiBPFjagL/hOp4/2Y8BwCcVWD5eW1s/i94QP+xXnD+K+5E8Aef4P7pCYb+4fIK/YNg+v4bk+z5L4Qe+ZW+6vSCTnD9F3SJApMSEPim8D7+9uiO/kyscwKoYuz5r0Ag/egKdvjzs1j65SRO/+RcgP+XLvb426Vg/Fb6XPTTHCr/fcL+/29uIv0Ai5buW6V+/VCZiv0KVFD8wvIO+NJBpvo9K8L/InaW/xT4Dv9Rs+D1ZiwI/d/SfP+VOiT5F8U8+NOSfP9iFjz8IR4k/XLGDvpo6Aj9Twua+PeTJv9azVz/dtZk/zCSfvo5Kgr8Iq0Y/7I8Ov6pGF8CgIKg/adPvvlWezT+SBS0/+fqhvmHYbD/BtL4/onmnvmsqFz8LGz4+MchFv1bzzT52XTK/pF+1Pp2J8z6W+Ak9rbPDPu7tgD5BHgs/0d2WP5zTg73igQq+nSukP8hZFb9Kb029dN8IvuSaAUAhkfg+ZHXivksETj9XL7Q/cTR2PtVRU794/6A/Ls6YPm0xxD50V3M+DM2SvubdOr/qzIA/znD9PhaBfD4oXk6/3f2jvjnd479FyFu/XkrpPoAwBz8w6y6/5udCv5baIb+Nk22/lIvWPzLlLkBh96s+2r7wvkqTob/RRsu/aeTrv6aTab7g4JW+bb2qPWSu9r9ffj0/",
            "kSihv8fYDEDLQXi/V58Mv5GEAD+tIhu/C6EdwClukD7qQ7y+32LPv99UyzwZQ5k/giIJva7JUr+IZsM+dbuxvxZtmz9PpOU/mlu6PhX6UL6FTMI+yh+APoYp4r+SEOE/fRyQvgx/irwWtSW78CyiPzjoTTwD5fc/Lb3VPqqpQz84mW6+k8SjPk4tV74HeoK/vyn7v8rEvr8gKY2/1MoYv1krmb9qr5E/XcK5P0fTmz8XWle/Zx/7Puh5Jb+XQUc/cTLxPzOzqL5Y+7m+2JLgPkiatz/5iZI+mtZgv7bvPD9S4g7Ayp+uv9EpWz8mkOI+EkLWvT8nj7/hULo++7qHu2tWU74tngtAhRKHP4NXob7ARbm+wFXLvzvTCr94XfI++R0MvxIznb+Yoj+9SEfovx0EvD7hqKy8Rkuev35/jr+pEaU+FSWkPzulnL9o78I9bWKpP6MoQD8ZtbO+G9apPyHvHb/VZyg/5ZklvyP+U7/sFVI9mBUZv+M+DEDfsbE/3t2/PUAUJb/RqP0+BKvmPLbWHT7hbka/psVyvgQU5j3yyJs923Uhv+i7ej8Em3G/qotoPdh/5T8xu5A/+As3vQ7ltj5Bdrk/zLfUP2Darz+MUTo/A4BZvsXHtr5ZgBe/Qa6WP3t7Hb/6lnE/gZARvmNfBD9ino8/mKC6vywTq78pM2I/VtvOPipMtLyoUCS/Gg8bPJpoRT/LjYY9UkWcP4iRYT9lZlS9nUvzPlP+6L/KzpQ/D7oAwJaduj5htds/Y16Hv7DWY78RCNy/cLNLvwwI6D/iVws/rCu8Pn4xHL1xyuq/TzTaPsLRp79t5KY+FVv1vkqc5j9UGB/A5QAHQGmfpL54Z2o/5yWGv5/h/D7rPQbAOnq7P95ATT4Gvo+/oc/gv+rXk7yhdOY/rPbHP24L179ZeoM/WYA6vwhZNz4HrqA/zoTbPSWqx75Sjg9A9LurvoHAVr8SjCY+eZBAv07aNb6ojgc/OeOtvqwXeL8ONTC/J/yhPi8OjL6lNQTA",
            "HY22vw8diT4AeKo9uKkdPzqFWj+2l04/4FfmPvNy6T1O15A9SMKiv9pSlD+/SSo//UoJPfGK5z7bCwHAp16Vv25qF79sgHi/H6cBviJNmT+yJpo8+yiPv1FXor63EAVAokKMv+hlVz9RLYo/AgrKv9WqCEDm0Lu/LkV8P110BD9rgd8+l5g7viaSrD+INVK/LZCMPrhGub+jvmS/WcDvv6BXMz/1rT0/wISlPhAaLz9UjK0/TGKHP71ZET8CsqE/4WmAPy3p/r4RknQ/E1p/P9hWwr4otKk+Vr3fv5B61z3Fkwe/9bVqP33irTs0KKA+D23iP+MJiz8Uuo6+KJFHP/pdzT/Jrj8++NkVPsBDQD95qmm9gWXivpdIq71L/2A/u2TMvvj6qD4leaq+TmD8v4AjBMBeKyS/hJcPP5yAzT+yOgi/TT6yvpwPsDy/Q8y+HnNTvuArtjzhNDa/QalXv/N83L4GJ0e//z24P54DlL+zNJi/OZF7PuXM+b0lpZi/teJcPzhBHkAwj3C/GG6lP3/WGL/IzWG/l5UAP77HO7/rE04/eZp1vVrsTT9KOKk/Oq+EP6DPHL4uQV4+xi84PT6R1r/C5DE/ebAcP/vEcr93tjW/4kJHPsJyn78/dV2/5Kq8P0DpLT8eVmK+mqu1PYtv/T5yqNO/tuYYP85GzD65JPM/E64aP/GHXb8Vn9K+cLRSv8eeQD8TP4S/v6quP/oHED64Z6Q+d8WGvs+Wp73luZU/IpaCPpHRBkAuc3w/E4IDP6qdHT9FFMO/4ORHPhTibz/Leco9cFCtPWjlTD8HzUe+Ioi7P4KaZr7hUxM/Wzlqv/jmx75YLgE++pbivyiZLD9nJBg+2wWOPRj07j58UYm/wUoOv2Rd0rzG0Lw/QhJ3PYIPW79bkrK/8TotP0+wcD+49AO9fwpwv0h27b4n3YS/oXGHv5HTUz7RZSI/v5mTPzSoCz+lWM69KHZzP3VBi7/1PrC+nQdxP1RnSj6adOK/hwkfP4MtUr7JsIS/",
            "PDIywJRXGD/SR2C/pR5GvwBIjz7w0n4/uOWvP3yS+D0W764/KoYjvqrbdD4hzjvAAxw9P5QB879cDaY+8rMFwPAMXj2Om4g9l0UCQEXowr+equY+iVYOQBBbkr84XZe+LfVgvyh1vb8kC4a/ezTIPriyDcB3igW/g07dv/g2xr9drEW/BVJJPVYPwD7v4zw91kT4vSq4qz59y5I+Zwgtvzihgz/Oafa++A9IP4+fOj5UX/C9anG4v9M9aT7fpSm/Ye0LPnmLdb6dfru+MrSYPwbIHz+Nkko/FByHP67itD5dIt+/17xYvuULy7+xgHI/Bn/Cv8Xbfb/xunK/id0IwNJnb7/ZKkS/UrVwPtFGDT+lSYG+aCYlPzaAML8Ts4A/oZP5PkKeFr4Zb3+/vbMDPkQyJD3vfSg/6bcAv6PUAb+MmTw/09Itv/uyKT76VJO++R21v6sskD7k8BE/Jvx9v2ziMT6NsQc/iGwyvrycJEDcUqe+vve9vyXQ9r6op2u+RlfHvybtNj/thX8/WxwgP6jgMj8bIlU/wlFUvulhj7893Lw/9WOqPmpjnj9cO+C/pQuZPy60kz6NxKa/BWuzvzyIAr/5dSk/INVSPwnrij9c07w/injyO0tDGMBHxIu/fU8tPhlPXD7xaZm/ZthqP58IuDyAeIq/0+1Zv/fkyL4m2Z+/XvuKv8TRjz6Wzim/C8ENP43im78tzfi9V63IPwI4kD+0Vp4/J7fQvp+pXz/6Bys/z1LSPD6GPL9cIFK/stqIP5u2wL52OaI+VErMvYfBvz75DRk+9YKKP+hdlL71zoC+5BDJP1wcLb8HRxM/wk/Yvm7MtD34ovA/+GwIwLsbbr+EKM4/d9FAv0qgdb+VeDU+j7iNvzny3b79DMm9ofwTwMTi7D8hGZw+aqzmv3275L16qki/1OQ9vEvqbj4s8Yi/yaCpv+Rc274cDqG+GG1xv57fmz5+mAG/fKWsP+xUEsAjbzM+8FQkv5lHmj8Xjek986E/PrIRYL5kujM/",
            "ANXkPpDfET86BYi9Q+IHP2LJjL8ujoe+6+cgwEd6GcBtplE/G4F5P7Yl9D/VXyW/2XIFP6krZT9ep7E/mnG3v29f7z2PH5O+UyEqPuGq1D9vrCs+1E4Qv9SKmD9nozFAB4mCv5P29T57dm0/wxLNO8Qvuj/ALIG/nGBjPxgZh7/qTpA/05v4vqTBoD2pIck++kulPPq4Uz/n7UU/vMCSv0AsU77nlXa+uMwEP1d0Kz5TLCe/saYqv3XiRz9k+8c/oBBpP14pGb885P+/lckAP+NoGcBBNCe//2qxPlOIPD/3WHO/jhaJv/OLnT+alFK+MHkgPzhLzb/jq5S/Oj6IPi2ot76ro6Q/49DtvZ1NIT8U4SfAhLVDPhjFXT3lWyA+t8HAviHoDr42hig/2NOxP4zt9L+U6FS/2IrEvnUGkr4hIR0/IBYkQIcCIz+jggrAaWJrvfyjQb6xp4S/sNMjP3uSIr9ua8M/2zFKP4VoNr8ODRy/cloFP76muD+HdSa/iYNZP3qAQr6hKJ6+eA3SPsl6e74/JIO/29HGPj7bSL8Jd8a/qg9YP10ia79AnIq9a39Xv1uQiz9cCd8+muoaPaiZYj8B5xI+25yTv8rPh7/2PgnAb/yjP7uLKT4mwTK/xPcQv0IWZz/9RbE9FGO3voBGmr8q55C/+SKtv+mEFT20g+4/0lGQP9Zahr9qA/a8cEPfP7AFEMAv/w4/5QQjQFHerL0/Ox3AW2g6PyNc6L71ipE+dHiCP8FE7b4fYWI+e6cOv3j8tz9MkHe9LbeTP2PncT+aig897ihcv4J4nr/yZN4/8d7sP4NsYT/GFd8/MfIuP5xqi7+RUmI/x3Mnv7I0o79jvoc/NKgFPgvrD79/sA4/KMCTv98nAD0tx/U+v/UhPzXdiD91KVW/+5jWPa895D97rkI/q/7Pvq0U/D+Br9K+BdWqPsPWfD/vITk/fNjUv7Aalz80W5Y+ZIA1vbFKu79QsXa/pQtFvjc5y71peHq+iEMev9SKaj/3RyU+",
            "XuOxvwMsED8igQzAte+ovZveHb/cnBbAEYcWPR7nYr88dUg+KVowPjG5Fb7oMw2/HlDTP8xfXL/csGQ/8QCEP9Tlr79wAES/xAekPuPS5T4oWX2/ugnDPpCNAj5QW+A+sE4JP+4SSz8NcxNA0qGuP09krr5RsZm9Z3pGP3zKnr4wxCE/QVSTP8ORyz+KWUQ/ut1vP8My6z64d4i/s/7MvlJzS7/xQgbArgUSvnK48b5UX6Q7x89jv+31F7+oz2G/EOZAv/ZWxD9oE56/ok02vwJSMr6zZOC/ZSiVvv2jtb4zBq4+Tkp1P0FY2b+c4LK+qhgFP/a2wr63hMS/YE52vpSG1D+4oqw/X7HHvp55Zj6Z/Fa/8UKFPja8HL5Vpk0+WSlVvnrKgj6kRYE/Izk0v2C7JkCXdcC+8MbLvl3rJz+nbHc+fAzPP4LDaD87tHE/KaIXP5DTtz+hoee9b7kEvndNAL/4MaU/fl+DP+86Nz9X6IY/G2hCPuTpiD+mRms/I24APZUpzT/3wHm/8f2vvR1tSj7F92u/Y4MnQG5/bTtgYyS/IzInvyxzdL6Q7BDA2Ha3P9Emnr7e9KM/5kiwv7txQb8wZ569alInP3S5qj0HuLk8bAu+P6xqVbxfmZa+b5U+P+mdmL7QlHg+wmYGPmcy3b/t8no/SCU+P36IHr+55iC/2f39P/8ZAz+wse4+ygElvz5Ds7+snRg/PMLSPjRi/z76/7q/DrSJPmh0Az+EqMS/KOLYPbTcRD7vMzm/K983vxl0kT58E2y+MPkHP399r76UDGW+ToU7P6yEbb+WTLG/HWWXv2P1ib5Gpe0+8OHxPvwcwb4wdYC/kBg4P/+FOj9lNAw/ppdevbUOOr7cRZ2/dhyWPy56Fj8mgKC+YkzTvrohiD8AuZA/nEvAv6WDqL4gG4k/0j4HQM4ZD77bKpW9dGZoPkA/eL5IePo8x5STv3Ryer8sh6k+kQ8pP/VOwj5hqYa/7odkv6cB2r6FTly+xUOIPkEqMT/9IE5A",
            "kKC0P767Z78tB5g/QHSIv6QFiD98o5o/NVvXPUeC3r8U4Lq/g85nu3wFnT4eGP4/wdW/PlMOiL+1llG/MT4iv2UltD8QKPg/wJOaP+0/KD4M0I+/Gpe8PhV+gj984N6/7i4PPikWsj+I6M4+O8mQv7eBg77q7Oe+1njWvbkZPr8bQla/ZYK6P4qlFkC4tlE/yhn3vi95wz/y1p+/tbHhPPV03z7PWYK+Lrc8PYKrPT9+bMC+NLsbwKKnJz4iHuC+dAVnPzZv/7yDJsS950qCPwcTir+DlMm+ernXPRi/k76hK9w++PQHP/FL0D/OSO49jqcFv9bMLL/IByU+WVMyvvUuPb8ASIU/YeQ8v2p2Yz+5rci/PrV9v/tNIr5U+qG/tJapPX7Ak79SEwU/GZdvviPWhr+lW6G+RHxlPrJ60L6do9g+q0DcvvhQgD52Bpm/cFcePoht9z96Qik++eeivwC3R78w+1U/arcLQPr9U7+rnTm/KqsPQOF+rL8rNqK/epNhvxLQG7+hDSVAUCgrvzxl9D6LSJq+SDsYvxrrZr6bz4G/lSQOv6rpxL+KTh3A1AYUP/SqBcBq6ZQ/2ySKvlhatD5U8SK9a7GiPjFPC77DZiY/VYijvg1DV75lOC6/w5HFPkCicb2jqqW+xaMTv9RYmr7OuZm+vLD9v+DGoz/HsfC/FAGqP9GZQT867+s9W2vqvv16pz9QeMs+mpCDPqbZZb/O4EY//jwAPzqGhD7O8i+/8QqJP5AOvT44ZJm/NxWvPXqHND+0P+o+jSdHv54PRzyLbbi+ApCqv/nZ5b7sF30/dPqovTr8Ar6GjQS/C8itPoZp9j5QOO6/7PYbvnarN7//JzO/k2E+P24wrj2w7XO/6RGeP5hDwz/4zpe/fwKEvfg9ybxMd8487Ah2P+FyAb8zPVs/w2eRP/qQVT+aNUe+3qh+P+KvUj894Vq+VLJDv/b6qL/wRoC+iPNHP6VbGL9Y4Y4/mftGv1fpPb/w1Eu+lcQsvbLUz79Epo+/",
            "fArMv6w4J7+btMI9g4NOP1Q4hT/dyOI+GnUOP0fQ6751uee+ALQ/PoEdXz9LriW/u+bHvxe9872b9ZY/luM9PhT8pD/OaBG/0QWfv+jEjj84IL29DgIEPVWlKT57TC8/3aGbvzLBhb8O5qO/O96EPx8e5z/tk42/cbOQvgpR2T7OgR8/kbXEvyu9vL9CMNE8sfS3v9NkGj9P78y/22gawIeKE7/0HZY/OBOLv/E4eb9pagw/N+wMwC8HB79FNfi+I2+SvttSIj6gSdw/XScfvr8rfT+SR20/4TutvmzGuj/iSHs+OawXwGU48D8UMsW+VU7gPdkaHz9Ksgg/yyoLv3qijb74/NI+gyuyvh8lYj9RYso/j73Av230ab8Y+kQ/FBTLPVB8AUBEywU/cECjv+YFdz/veCc+pDV1P76Xhr5B71m9JCp5v1QdRL578eu/OAMzvtacWz9HDoW82H0UP0rrCL+m+ii+tYMnPoznor9Vbbk83UgZvprTvD50tUQ/lwpDP4Cj8z9mEl+/1eJsv9iOND/HVoe/6kcIP/2OGb+opcs+GRuLv2ZzG78i6gC/8DM/Pqh4Qb+6aFO/IMaGPt02Qj9Xt1G8O46pv227Rr9tFVY9mBmDPUneA8D2hO0+192ePyBAHD488is/yPHNP3xVWL5NSxc/2Q6Kvhtt1D6P/Ke+SvGZP+OWZr7jTq6/FBKfv5vmtb9oBC6/1qSnv0plYL/hTaG/bVdpvghQUz+nq1W/ElacP1Q1wL6A7tQ/kpNOv6SfxD6eosq9YThFP95CLz8r72e/U8Qav81khL5KT+y/Yk7lPlVqvb9f2oG/xuLVPc17YT7BKwDAak+CPyavu74HeY0/dMFVv58tIb+Z4rk/UVYvP+rarj8CebS/9Mqxv0cLIL+AsgNArFc8v7drlb+Kpug+z8Kwv+D6mL9i85I/w25nPz2lRsAzspG/XKWyPk6NOD7N26w/0GzbvkPWCkBcadA+zIn7vjjg4D7pats+0vO3va3RrD8hz2c/",
            "qKJzv2cpC8Al256/VfUFP6d6pj+x1ck/gcLfPjXrBj1Q2lM/M0RnP92TiD8zsgQ+uaEiPs/H8D6cPSo/ggMovi/LbT5WCDW/vWXKP8lvrj522KU/LVzTvzXz5L4+IBg/NcGLv4xKpD+AtXc+88ulv7kwmT+3CkK/1+XVPgvYqD/GEUm/aXK/vmCYkb+AjDO/SaCLvaIUIz7hnaW6eItsv8QvLb8QOCg/gvqOP+g4r74Z0vW9So0VP5gaAL8avIq+xPGvvuwMBz9z+2Q9pXarv2gAyr2mwaO/jUzLv1Lf4b7RJn+8V8FavIQO6r48eaI9YEzhPigqRr9SquG/KD+qP3Zdqb9jfeo+wJHjv3mHBUDzelO/Ur69P2Qum74Lqx0/AjxAPl2XAb8hqHe/QLZivg4vtz8MHl0/ZTCZPuX3ij4Lcik+LBw8vnmtIkD7RpO/0v/XPvfG5T1pwIs+l2ldv1DLMz7QUQvA6fQIwF5sY7/yEMk+aZF4v5fVDj/pC3K/bd+UP4IShT99dYC/vfXFv4M7tDyAxFe/AezTPw0Llj89M4w/NBPGP4X98j4pyn0+RApxPiQ0pb+AJsC+CHEFP/L+fD8thRDAO0ecPwPaeL5VOzM/pELHv5nyBL+ak8m/NBceQKgIDb8roWS/pv3wPr2iv7/ilXW/t9cev6m4cT8t+jE/AjaDvnmGrD9hVns+RpIkv0Ab+r6/QH69YDquv13Bsz2Xmsq+XfnEPhsbyD+Gu6e/FhZ/P+Ymqz/6Jpc/X1aUPUYMOz5nwIA/a6LhPq7vJT/Wihu/OUkePrDUKb+gmDc/PtvePs/fQD86rDG/CFoBQHs47z5mfU2/vBvjPvksMT+HpRw/XPLQv/W8Vb5uNjo/T6elvhZAhD9Ynz0/X6MKP6N96b/2FTY/ij4YvymVI7/Iwow+x6KwP6IOKL1a6Ly/Kaj4Ps41cL+UR8s/ZwuVPwXmkb+PRKo+gaZhvwe8aD4wlUU/GoMAv528qT4MhJa+ZtBxv1eY/z8mVkI/",
