{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ],
        [
          "qp_input",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              68,
              68,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "init_conv",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "init_conv"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_1",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "init_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_1"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 24,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block1_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block1_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block1_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_2"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_2"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_2",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_3"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block2_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block2_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block2_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_4"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_4"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_3",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv2",
                0,
                0,
                {}
              ],
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_5"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 48,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "block3_conv4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "block3_conv4"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "add_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "block3_conv4",
                0,
                0,
                {}
              ],
              [
                "activation_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_6"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "dtype": "float32",
            "name": "activation_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_6"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "max_pooling2d_4",
            "padding": "same",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              3,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "activation_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_4"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              1
            ],
            "dtype": "float32",
            "name": "qp_input",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "qp_input"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "dtype": "float32",
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ],
              [
                "qp_input",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "sigmoid",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "dtype": "float32",
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "fc480",
            "trainable": true,
            "units": 480,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "fc480"
        }
      ],
      "name": "archiGlobal",
      "output_layers": [
        [
          "fc480",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4-tf"
  },
  "hash": "020c42fe158c62347d249316afdc189996c40f8bb06f7c316caae209de41f0d1",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      68,
      68,
      1
    ],
    [
      1
    ]
  ],
  "output_shapes": [
    [
      480
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            68,
            68,
            1
          ],
          "values": [
            "GXz7PRzZ477SM3K91As0Py6x/b5XXaO/cl9VPmaQcD9ZOw0/4KUqvqNWLL5b8AHAr/d3PoeJCr/mf6O/4PPXvZHcA8AM0uw+5du+vlAYuL9aQUDAdTLkvzF1yL1wRDI/6b64PrnAFL8KsDi/bWYkv9EWgb+SqZ6/my8jQL64Dr8impe/E6e3vodtbL+A8qS/PMsGv85HVj8LSWc/N5GbPTGxkL9za0s+LN/kvZNwh76+Bjo/ovRBvzpRVL/q40S/DoeTv9e0XL8S+1E+uuY8P51/oD0Xs10/4agKvy7q6b8S4Ji+INW+vk7YED+DsQ4+xXhJPnn/Gz5Qe2a/iKUWP3CMGr+J6sG+PmsjPyMmGr7BEli/Q1QYQP5czb4WXKy/N3RJPhjaNj/Zw/A+7/ALvxbzIDxCYkE/pcMSP5v9nb4l20M+3/SNvMjFTbv7RpI+uhoZv+Zr/D6UlqC/j6uzP+Tzh77hT6W/yamMvnqrrj/CYWW/3ewbv6fxVD8JZZQ+uRMgv6TbuT+vNYk/fKAVv8YitT+YD92/SYeyPpJ28r4cpY8/1ScGv2yO8T2zQz4+gHlPPqddDz6W1Qa/Fwn0vRsDET+dTHa/2Wm9Pg8etb+WAZs+FwAsvYRsZz/4rQxAx1elPZBbdb1o+Ea/Rk9GP59jcj9YB9W+C7KTP0kqQb9d4rC/XjYqP1n5mT1FKgzAH97SPP1TZb89PHI/GNM4P5AVGb7cWoQ/xZGvPwSjjT/wxQTAAD4xPfVMSL56aP27Hx+FvzR/tD+P1g3ADc2bvm+rab/CGAE+yxXXPj40AD9LMPK+bLxBv2thLj9gr4s9LGEmvy5WMz5TNic/e4gZPoz7MD+xeN49v6AEP/lwvj0K0a4/QFDjvjQWiz+XAHa/KHXLPc7HPj5WElg/2JfAvxL0iL5L+Vm/Y5c0P9b6Iz+HpQa/vNEvv8xsvr9XrnA/fv2KP5X21T8l/I8/dsTyO6DJUr2z+4Q/DzSLvxhsS79H7ke/GOYUv/Lwqz1PnSq/",
            "MLU2vzdLjr8yQ7y+QNrpPwY9kj5eeZI/aAwgQDRk7T6WqUs/4DSAPoVU1z8rrbg+Qy5bP/a6wj9Dfrc+xhT1PRQNTT9aPOU/j9q7v0LCiD/7eRu/aXdZPlr+3b9D/SK/5dkSv3Ijy781BVI+/4o/vmHJoD+b6JG+ExSDPc53DsCS2dA/1PJWv+kxWD/HK1Q8r47cvndXbD5BEqK/9KvUvp82LUCezwm/jidcv3hLIL6SW2g/ky7JO85+CEAHcrW/vwPXvSJSJ78feAC+Pz6IPwrgJj9/hfo+lqIzP3HHEr9pRSe/3IqqvzsY4rprrzNAuzBNv9tIk7/qrxm+L9bHv8QpCj/elpc8nIfFP2+1br//F7G95Ccqvp8kqb+JR92+dzmPP/D6wD8HmI2/MPcEQLx6aD5/bum+pW7Pvdt96T/J4U4/6EOsP90Pyb+7Xzq/PuEYPwExjr/RoMi/OVoOP9kUBD/7o0U+kDZgP4V+nz+jq2K8Dnt6vvOzCb8W9FU/WwLMvbC5zT4dPR6+3SojvyBw7b+J8J4/DlWivoArjz0JDPQ+LjiHPw3sHj8mP52+c7nYvudDrDyvxc++OX0IP6aW2z4bgCK/Hxj9P42Uqj1aHRfAS3n5vqsRAb/KyZK+gfq0P2FbSL5EM0e/0Ctrv8gbGb9grwS/cHQvv/bau76wXPe/vMYKvoei/D0ibAS9anj3PjPVTr+wsH0+c9KrP2TsiD+lAVK+MU21v2otybkmwNw/fZiuvPMNZj4r35q/efm9PytYTD4pRJI/E09Iv87XDrx6mq49Tl10P7McO7/ZVqk/hTtUvx4q7L+eByq+V+Aav9Gqlr4I8aM/2fuSPwGxOj7je0A/1oCJv1BO8j7cLaI/EmM0QDlO9j561JY/bJIIP8pC3L7N7cy+6AxgvVef8b6i7j0/RfBQPy42IL91eaM/2HJWPxo92r5Cgwa/rJ31v6V7GT8Uv7O+ym8av6llzj9Qm8M/56Z/Ps8caj7Km1w/yPfgv7z1AT8aOkZA",
            "+eWEvlUUlj8eE54+mTRXvx6MmT8ezxY+PGLFv/Unrj5E2lY/q5njPopySb/JKGM/fMg/PxQw4D9eGH8/jXs7PyJpAj4LjKQ9m2SPP+68l79oIik/sEjtP2vw8D7lYCQ+akMuvzvaTz8oSDg+Xzc7Pifb1z00dfk+fzUoP2HHNUDDFrM/aLkPPqG4HT8U9Yw/l+sAPhct/bzudT6/GdfBPkC2lT/+QwNAOLaHvr8QET8ozoy//DwnP33chD70wQc/ilR4vq88GL6+bC8/29pMPxBP2b40klI/hHTxP+ij1T0mRrs/X4GhPi3iW77oVuI9cNkTv2jbUD88P5c/ugeqP/Hjv70TjhS/rtOSP3Hr8z69yiw/qwukv3Fwa770VYi/UzOfv9MYiD5IxIY/I0iQPnXQtL7cnRW8yymBv74jiD1n78W/AKC1vxRugj+kPMU+r0ecP1hWED7jIjU/vBuHv8B3J7/V4dY/8KAcvrxcp78tvzW/ITKXPxFiKr0Vbf6+lYqkvRdbdT42Fsq/g3qzv4WFnj83XZ6/p5WVPBJlyj9iPvI9oWSLvrgcR78PL3Y/A/q7P984Jb+GAXw+vra1PwYr9T8uSpi/M1FaP3Op/j4pKpg+FfENP/ZBcD9w3zo+Ipuju8KuDD1ceZs/TclkPxV0mD5o3T8/UAOTvZFaej8Ie78+Q/lHP1FKbj5EGta/9CgLP0EjND/HVdU/6BIRwAQeh79H7YK/604vvBkoED9+RRu/wphkP2nZ075ixDi9Xw/UPykKnz8399M/ziv8vlcTE73DoxS/CaiLvonKkL9YUGS+3ZabPnvjBr9GNJM/r5IovkE/hr/YonE/UyWnP5KS0z+3tdK+nf6dPqRQDT99QaM/Ts4sP6N2FD+og4U+ZEyRv+MV678y3CA/08SNv38ebLz5PA4/v5TMv9R32b9Gkm2+QECJv1tZ3b/Jvia8CskJwKAZ3L/+DAE/n7CbP7AVMj8PjMC+G/MVP+RZjL8DrCE/5ZL6vZ4Gib8rj3g9",
            "IX0iwBLkSr/yg50/WNfjP/wLAL+5QlW91/P0v4UX4D8lCd0/k9zBv9p6Ab9/eJw9Zw8SvzD8yD0PZyA/mD0lPy97A8B7slI+aOaJP2IQrL9ZdBI+yqV6PhOqg79Qb2A/zcxAP9c3xz4ris6+knXqPWZu0D1aojy/AXp4PhAlHb/PLeS9lS+9P3IuE0B/ps+/tpymvxXVqr9tu/+/5/29vzxIa7/Fmaw+PL4zP0Hh8D4cyzJAVt6GvwDXEj/c71S/1o95Pjpg278UKxA9fbNfv98rwD90oHY/rUmQv0cCXT4EyUk/4fmhP7ZKFL/fmVg/OMlzv8LOQb/l9QW/PWuEPqgtgL966ok/6y2ZP9IKPL8s01g/3NezPrhLV7+etCa/XlJ0v3hoOD+9Xfu7aKTVPh0/s7+vw4y/ozITP7I4cT4OeTi+elW8vwifRz9/8tI/+KCkP0jZLj9WzHQ/fkoJPxAVtL/f4ek/QBZlv0VpBsAy+9y+hc1QP9/Ewr+N1Zm/TfHmP8KALb6DGC8/kdgJPn1Yzj4R0AhAAGKFvzpKAT/liB4/nNC8P++XxD85+ss/wne1PbtojT4XWrS/rIK2vZoYMr9W3ZW/01AYvs/BPr+QhBS/Gld2v1bCC7+9C/69VLtuvgrhzz/P6ou/QkaOvvwhrDzHy8s+k2D3vR0zfL+yp3y/jygaP38Fbz8AhaS/Y+AtPgx/uT/zXLU+kP6xP851tT/dPm4/ClERPulscL9Kb2+/epCbvzAxUj4CWJ8937onP+PurT0be4e/RFgNP05LFD/PsQG+kzeWvrlfHL+EnhW/6hplv0rjmD4jDd0+GDBuPyOr0D7Vuaa/Lhwav5XkdD99IWa/OXFMvzkKnb882qe+elLnv4eogb94biE/V/ZMP75uY7/MdkI/+wJDv6HLy75Yj3u/T7WqPSojmL400HU+j0igPwPrUb9+Q1E/LSPNPQSVnD+cVh49WINmP2oFJD8Ba8e/NdQUvk0/Lb/RCqA/DLzEvkb/uz4nmk0/",
            "UoKaPonF0b6uRU6/4RKZvhdOP72X0nS/dOeuPhLRID+7W4+/VSZwPynBRT+UBHU+9cpMv5quNkABcHG/k/kLP1ezp7+zHEC/5vCcP2eiqD/Na5O/hilevwXCa795B8+/akUAPwZ+7z75zqM+Ng64v//eBDuNbY+/kHuoP1ZIgz92GZ0/3aJdPy8axb2Jd/6+kVOdP6VnDsD40oQ/Juo3QJ0ber+xraE+IgbEP4kR2D+mIoS+kJjLvjJRiz9RiRPAtqSovn8EeL/1dSO/0DWpvyAXvjz9FP0+nh27vtTrVj+ANfO/yHsKP+WE0D8bBpi/97KbvwhRsz9U3aA+MaAevxbbC7+UhCy+mjz0vhQdCMAA842/Lvp2Pw7Aoj6rKme/ArVQvwWopr6RNZi/GlNVP9k3CL8qVsw+v+AXP0q+8r8YNKW/IrRLv8oeej9gQSu+xTEzv3jzkL6pcDS/WnkHvyBYHr/lMpy/Qy/CPZpdZ765jFW+tBCjPhJcaD5EaLe/a5IWwOzXTr/bP6s9mlP9Pq75zr+tMjQ/YAGGv6t8lD/9dGy/0M5Bv7pxrb7IxP2/ZGWNv13Tib9DKuk/t+zYvuLl0L+AWV2/sp8tP8snF79iYF0/67rqP+KM1T6Y0+S/PAxIP5jbmDxHnP2+Y9Jhv0krrr/a9U4/w/MFwPvsEL6CzDS/P075v5c0FkDngry/Rwc0v6H04b6rt2o/DNsVvz5df75QRri/T2oFP+h6mb6Z3a8+ezQZv1LaW78Vfg6+rHUUv11Nbb/1J4k+wkisvr9XBj+JvIG/eTAhvnmDmb/Ja729RMatviYwkr+k6W8+RdeaviH6cT0kkm6/0iQ8P4jSYz/GVLU/D9+NP2BZRj9WcjO/5RIVwJzbZb9xWS2/tsTZPoRtB7+YKYm+A6gtwNoE/b7ddUQ/0OHeP4O1kj5AkDG+XZz3P5WJqb4xf9E+ryrUv+1+ob77NmA/MUPqPr1zk7vSy6k/B4bUPk45gr/EfJ08toqAvwtJfb/01wM/",
            "FwZsv7HHhD6zO4c/Qp9Av8LzVb/s6zs+zUvWPhUu2T6wd8U+PvvQvxK0yz+Rnk+/2oUYP69uT7+2y7I+brMYP/ZPuD4tfyU+XkscvtPzDL5lUpK+bm/jv4ceMb4nw8Y+SZyTPJjEnj7dzZ6/j3XFvxQj8D3GSaK+lRNoP5KhfL9iZYi+3k3ZvsaG1j5VTTe961aXvZfrQ79kJwW+QkIkQLTqTD+d5To/1Ehmv+yHU79l4WO/Vgxnv9tiLcCZHdU+Mc2XvuIKor6F8G0+vyaNP4KmGT//yDw/FH/ev3FjIz/HrZA+oxayvsgQv7zyUYE/FKE/vn32ib7bVSy/wGuGPQWsh72YCB4/XH+WPtEspb5vuJ4+TuXOP4yP+r41/Zy9DtoVPysz6T5AUoa/TEfYP7dJJT9nLHC+l+QWwIlwhT9rysm+k5XpPt+eFj95Z3s/B1mMv/wTcz8HZKy+S2XvP6cxoj9eCqe/km+Ovw2mIj8qCQK+BfANwGb3nr3xpky/5hqSviYulL9uNDk+pAXLP+NBj77/O+s/FEz0P7lu/j64tmE/WMqFv9cdhj8VrSw+v5Xtv4L4MD/WOhw/snJtPqvuGz9jSg+/okVSv9pRBT4Pbre+vu7ov3QAPb/yioc/2DNkv413Ib8B72G9TN2NO7Gw2L0qDT4/gtUUP9BjA8D2KGc/stQVwDZOuT+vY/o++HLVv7LPjr15XPq+vOs3P08vQ785Wb+/i/c2P1UApz9q45u+j2DEvwgmQ7/fXw8/Rp4cP+FuZj38dEk8u754v9SgmD9BSS4/pb9Svv7VG7+rgDi/B7yAv/x7Jb95uEA/9pbAvuMMw7yjVJ+/bC8/PVGhH76m7Fw/cznZPbUHxL2ywhFA0wGdPwp/Yr4Yhla/H4+Hvm1h2z6RQdU/GkeOPiUPer/uhYM+UNm7v/b+czvPdb2/edXgv5sm5D+anC+++wBJPkqUKj9qi6Q/cUMMP9As2D+9Svc+pm08PwKlhT8TDBa98t3tvfg5iL4ZGYI/",
            "wQyfP++h9j9aria/8s0iP3WBHsAzq0w+ReOJP9E+HcBcvnQ/svmJP1F9W79X+Mq80EuPv6n3hb8z8Qq/aXn8Pg+kCj5y55W+Zwssv2Ml4D/JInq/Xg5QP8lpBL4nqsw/4/v9vyyEsT/lr98/LV9avxHdmD5M6XS/C80Evz6yXT82YqI+FLAHQEn/z75HceQ/9OGkv+s6Er+XRUW/Ge9MviC8tr4MC9M/BLdKvoRifz+1/Q/ASPAJP87X1z+zQYO/O8i4vl06Wj9fNgjAjF2pP3gdJD2PNTm/BsKaP9ITCbwPqgW/iSMnvlmKRL7Tv7M/pQajvJ4M7D+09ZY+ILkiP0jXQD4GmrG9sgnPvmp0ZT70irk/MV7hPulKwj+eC+A/9u1pPyFCZT+/pxu/A9v6PzbcfL9O97++A4isPmNYsT/TVsA+SoBMv3vyoD/rlvs9OB02PqLgDUDYZ5g+7zABvUjeHD+zjju8ZsXiP1aEhD7IaEO+R1GZPyEEgjwPu9S/Esr9v76fuL8yLD4/h+6rP7FJA79hDM0/J7AEP/4vFD+2BnA/Ucqcv3mZjr2n3RZA6t1TPWBWNDyosQU/7wsrv7SVET84ByNAntoCP25SJL+A8Iu96bOoPvhFJ0Cg34+/4HazPwsu+r7mc54/yhoVv1gDQj++ipW/fjojv7xAYD/l8QA/IzujPSPX0T+IBL8/OFGBvkaRH76aoLo/t314P2qQdj2PV1i/0dNqPyJSzb4wYFY/uoEvPw0unL2rh58/g+5kvv+TFj8pUZc/hyJqP0lcLL47on+/ntSxP4VKwD/AO+g9tEMlv1g/Xr+Oqho/pKG9PAHUsD6Dvfm8FOVQv1PcGT5+u6Q/qJcVv4bRab71t3m/S0aCPoqHEj8gHaG+xIjuPh6/oL+Sckc9yv06wJe0BL8X06A+hoZAP0NJ7L3nx/u9LcytPhz8LkD1vpI+GE2ePd4qCsD34CI+lgGOv4ewZr7R4ZA/TutFPharUT5g1HG+ZP/4P6Luyr+pmB1A",
            "hg/dPheSHb+rt2o/4IJsP4p2PD9FgDy/vrbbuguO6b9wsEQ/2JGePzL4FT8TmsE+haExQLZaPT/4j1O/aQpPPmEteL9Z+ws/Erc8v8ClQ78Fk08+x2SpvxcOQz43AI2+Ir0ev4zAGr9fWGy+AJI/v0FTIzwtJR4/OkJVv//Egr9VRTW/OAHEvzmAdT9hupG/Z/7VPhUH9b714IA/DPTpvv02Iz7lQpe+HdiZv/2s2b9I0L0/FEUrv0sSVj8qLTs/axwMvywuoD4gd6M/nz0JP3Pm+b5wghQ/3ge3PrkHFUB36aE/QFjZP4cmHL8Tkbo+5CXjvx6qqD8Yfh2/lzWNv0CxNL53sEs/msi9vjRa9T8mnSs+ujR4Pu0qTb6YDdQ/oUk/v67Zvr39ONW+WNpMv2bo1z4boom/+24Yvy0317/wIXg+2YSWP3NduT5obpG+Dlblv9oQUb+Nrrq//4WGPsPWZLyiJV+/ia+EvzYkRL87EVq/LrSkPxHm1z7apAy/Rx3DPyj5dT+M/lS+XLM4v36Xi78/7UA+Q8nYvjPp2j408RI/L/a1PmRvNr/3QGc+54fRPpGpn72V66K+lJfMP9z3rb7fgM6/T7jUPg7UTD+jXmi/t+wKPyukwL5+FWc/H+sMPvH4hb95VHw+wsWrv6Zc3j3C8EM/iqQFwIQ5Xb43Myy/UdUaP04YBEAAnIO+rNx3v4bTkL+X7Tw+ruWNPryjETxNpJs+dQZqv7ky6r4F9aG/V0aCv9pUND8fnLY/NzZkvwSY9z+17vq+LsICP6BJTz++9A6/t1eJP5mD1T8aS9W9+F2Fv57F9z7i0se/MN32v04ErD9V9WQ/g0yJv4Sreb/z6XM/Mi2ivV6aLT/21OI/PfsAP+5r1z4rxVw+2dMMP8AOiL8n/JU/+a/tv9mdwL6umS6+yeDivrenOb5qux2/3P+nv8hgRb7u7L+/OrWyP7xjkb9owb6/H0E7v2Z63z52c4e/T++GP484az82XWo/bQaavxDVqD7d+fA+",
            "ZHpnPw7DDr5mkk4/BzcZQJAFx78F4Ji/1QQpvtG8cr6CezvAf2sIP6mY9T6F9Pq/dosJPwYo5j3ILaC8vQDfPSu+dr5gyEQ/oqAfwIJVBr9lcoo+xZ58v0k6pb4TDkU/r/6Uvhlukb+zGGs/JCs/v/xK7z3DgMi+7jTBver/oL5aiHq+yFKlv12oqr4UnMA+5jGBP/yBeD4ibbW+dqpsvxeNsjyMLVC/0bYTwNmisD82e8++z2uBPhBKR79WOIm/U0enP8YFRj5xJfi/XXdYP4ewXj8ucdC/uXwWPyk6jb87nEk/gr4JQCS1Iz6Dm/29z9edv7W2iD+bygJA2xuHP1AxOb/JTse+IFKRPnPdvT4Imrs/ANLTPk8n8r7FUFO/SwugvaYkLr1r6Pi+TxWLv0KrpL9X/ps+QcqrvY/qR78qZbQ/rqCFPsQ03z4RHou/lEmAv/h7iz5kzM0+sTSLv7h+qD8+Cgo/R0ymPs/6Yz+Ymac/xLWDP0VWYD+GBh2/nLWcv3ykmj31QJk/RvOBvexKmb9UddG/kXhwPwyTir9a/GA+J+LLvxtFJj+KhHY/5fcRQIwLVj9Vf3a/sLdXPxmXgL5vbF+/agwMQPy7Hj8m0JC/Kx5vPskZer7RxDA/xbmgv5PI4D6RGW+/8W0Vv9gnib6UYoU/0xQfP2Rupj8iyaa/yzRiP5i66r93rIY/wfe/v6yber/84j2+tzlJv0X9PL+GIwlAVJn5P/vhrT42Ed0/K8aBv3Dtkb8Rw40/OsuGPiKhR7+59m2+HDDDPk1maD+JpQW/kSBev2v+o7+/T7G/j9XwvweDKD4ywo2/P5ULPrqtRr8Qfks+goHHP44NwT1w97Y/N5wrPv1KgD5ryOM+DoMdv0ozzT2VpL++SJIVPhtomT8W3o0/aAepviLmI78xqR+/To9DvwD83L4L+R6/Sr4BP8pCeL9OMqG/+mmIvpROqz/2IeY+EssRv0ZqKr9j/au+TB4IwCchy74OymA9qIzjPvVSPz8jqQNA",
            "mHYnwP0sQD+yrfe/fxNVPupYGUB7LlfAYg0uPyztyD+2dka+9ABfPtI67D6Mqt++3zXgvaLimD5qbqq+LpumPldxPT9zF/U+VfGXv4Qixj4hOZo+sQkJP/qcLr+lUY4/kGWPP1PlpDyhofm+xvmBvzrHlb/2F4q+Pfg2P82tEz8wegg/zAhWP+Khkz9wdGO/AZ+0PyX7pr+xSwg/N/9xP/+XEcDu+RS/UqbfPpiykT/bup0/Qw8kv7Pk8T7Xj+e/PsKkP5rPcj+oCu4+ZU+3vhMFxz7XoaQ+40vIv7quzz/9h6S/eTNIPXR2770RHvo9RGQ2PiX56z+HiVM/ZNKVPtp90b2q1B2/Ck1TP9vMa78Mn+Y+ZQMWv7WCgD9TfI4+hfcrPqE5Mz8waiE/QO0NQI8Tk773N04/IUwxQLZKw786c3+9TQXUP7DX3D+3R6C/xDUsP1TqUb5spZ+/rDIIv6eiND+2b4C/IqQOvx5Egr/TaNC94YvDv6BdaT+ddiY/JhWhvtIxHb+qBbq/svzZPruEkj2cTS4+442wPxub9j6Rs3y/MrgHvxu1pr8IZqc/doIMPhlXhL3ZBYY++lUAwGx3b7/g1D8/8OKDv3W/KL8uUAQ/DfQXPxREYj53Nri+lUKEv/D2Lj/GG14/VaE4v3aLPr9dj6I/OzjXviHfNL+q86e9N5Bpvn2Hf7+Mwuw/Y94OP3IbQT+gWxxATHuLP4/U873XRoM/u/IrPwlBQT+RPD+/bKkHP2QG/z9HDwk/rihcv+JH4r+Fggq/O7JCP9nddj5Ggpw/m/THv9tshb/18BbAl1+7Pi7Yyr1YhiU/bzaMP3C0hr6l1is/ncDUvpTLGj+1K2o+QYh1vzMxj7/6NX6/ou4UvypFrb9XgPG/+9qVv92ZgT5VyKG+DAxaP2A2+D8qsbe+9wRSP/5yDMC22bg/5l8BPnpVEj90Fzo/0n2Uv1UQHD9wGQm+/RmIvw9/ID7TSPy/HKPIPnojsL/AjFS/+1E6PkkmUr9eQIS/",
            "6kV7v/NSCj+/8DE/ygs6vn7/C7/wZtu+yncTPx2hAcBmbqu9YpOSv8TOUL9PTwo/AzhevyPpzj72/Bi/HZFhP+0p4T/LhDY+swKQvmAFHj81E3i/4wLAP3sgGsChK4w/RqWBP2RSib9esLg/Q7EOvshrpL9X1XK/V24av8CwpD++fyi+/xi/PzgoTr+337W/jtuQP+XfzT4fz1y+5yOpPvMwvj+8ljw/7Ow6vzDRB74CrFE+HBmtP6ivXz+eXyw/lpjzvoUOiT+JOMI/l15uP1wcEj490qG+PpG6Pw6/Pr5fDT9Ap2AaPmMLoj3NbQJA110hvwV4d797qyk/Tb0dvpMywT8ikt2/ngFivziyDcDJu3e/smLYPtDH5r9piYU/jypQv02EyT8imUg/wgYaPsMw4j824Gq+jP3cPNi4EsAgDAlAHZiKP4clXD4fopo/dNDCv1Mt6j5h/78/WknqvkzAbD/5ddW/cRX5vwqc+z8ltHe+joRPPYWHjr7dkbG/MATav0g7rb9u3Dm+a0soPyvhu74AEyA/M9O0vzU8kT8Tvp49k2Q2v9i41j7DojO/FXf6P4/OCr8ZBWE+Lqdevl/9f74VQM+/7QVhvyvfEj/bbTW/aRNMv+sKdj7fWyI/2/8/QN8EQr6hzsI8X43cP5QmiD9qwJi/4ct+P6LAOz8pn+w/lODsP2IDBT8zvlO/Y3/6PuyIYD7srCC/+RasvyyKID/poyY+xtyfPh6pYb8BDSi+iVCJv7nXDj8DSYu+jaQPv9FIQb9yCaO+SNONv/Fd8T/eIiW+b8UgP9x1Vr/Kb0A/GgGIPmR/Pr/yTby/dO4dPwQ1pD8iNw++fZaqPyUzRj9u+5W/wQ4sP7sAmz6iugM/bWB+P1sGgT9Degm+2q6iPW2IBr/G0k6+A3aFv/fcaD+SUmA9jbO7vlGUlj8ZdOe+QTGbvzF0vD2LzSE/DOhmP9ZdOL/NbmY/bqqTPjgE575uiH+/vp5EP0jKOj4kRIc+M1svP9W0Cr9KFBi/",
            "CuWCP5mcB8CKeQxA3sEov43TAMAkXwa/X/oAvVvtTj99rnk9KwC3PwREub61e+u+C40twOryBsCGzZ0/0ZMnPyonyT7J9J49rmyQPw0YmD5O3kY+kHUWP/3ej72HxVM/O9bFv8TIDT/Y1q2/HSZfvdjkKD9Ow1w/1H73P7QjNb11TXK/X5rSvd3QHr+9MJU/H3TlPnVyLz8LgiS/BcY/Pfnwd78kseO+RSkSP1TEub9DNo0+Im+Yv5Lf1z6knZ476YgvPxVhKz9EuRe/w+0nvveYoL8RrnG/nZMQwBiDqr5yFHY/Luk+vWFO4z8cZW4/h6XHvv+cLb/pw6g/Rj9+PtUEh7+X3QDA7LpYPtVNLD4S66s+Ehabv+rwHz1MEb2+ECXpvejoLz8rP+0/RM7kPE8o3L8+Dqk9q3xxv7ziwj9vDvi8hTclQFaEDz6DrEi/3HmJPhZygj9VjWq/AKVFvujjLz+KmB8/fsKDPvMQxT7jRNc/IH5Cv8pBij9tyeO/F/F5P/hGMD+Wcpq/piYpP4Wtkj/fktq+TASIvvp15b8UiiW/HzJEPrPWoz5QaQQ/UQUIvxzmyz+KNxE9qIpAPkEiDsAJsw8/9ns1v339pT/WkXc/fgZCP/sN2r9NXFg+EgOePo2zur4oTDk+r4vBvpg31r7D9VG/HdwmPUzvUj+5/U0/SkaVvvBEAjzn3K0+9ZBhv2Hn+L6FkmA/jXzNPqgfCb9R2bC+XMKJvH9qe7+rz9E/NN4WP6mMBUAlpcm+8ZeRv/3T6T9UqpC/zZ9Rvw/GOECYUPo+tP/Jv2t1kL8h7VA/zAiEP/a71T7+Baa/F/KnPv7UKD+50xw/Qe2ivwH5hb/mHk4+XJGwP1xkYr8byoY+zkEJwONHsz3GWuQ+Yp8Sv8mo4D8CIw+/Wp4Uv5Phg7/0T/a+IkHXPjltcr9gO0U+7DmmvcwYK79etK2+nDgMv1Ovyb5y2dW8hDenP5P8Cj6387u+n18Vvh2w0r7JeWa9ricxwFXhNT+Yu6g/",
            "oeJKwMkeTr689D2/s+xYP73mcz6a71y/5Z9aP+aqyT9u+UQ/y0CRurq3nD8oSfW+47mtv//3lT8Zboo6RjbGPk/EbT1PaPE+9e64P2Edij9ohNy++xSFPvinP7+qgty+14QXv0PCHz8XhKc+cZPKP9zsMz/qebK/2dA8Ple1xj0/uAPAgGZSPcxFvb+dSVi+/RwSvgK36j9o/Wy93F94P1EGVT6yMYQ/TNQ+vnKaar4jDZG/hyeHv04NTL78Cv8+IKLMP0nKbD9QG8O+kKCdPxGmPL82dQA/Vpp6vmPdzL7Ev5g/8JcAvoLTGb88Yv2+TjYMvyhL3b8AW8q8lTeIPsKgO7+Cw+M+ZWhTv6kZBECzSiC/URJyvk8Cx74rrTI/AmscP/nYOT6dlMY/Aff9v87/wz1cb7S/ENQDP6EiJD65vrY+Qg4YPmgRK8DsT/I/20M9v8/TxT4kOvw+1LcMwPoUrL0d/r69mCwFPov3rb9Z24e+DKTev+AO4b8eeG4+rZcaP9u0Ab4FAem/Z9NiP4H2/D98nKO+o0K0P4Gc0b5Q4bc/LNH5ve20jD9r5Ea+DRW8P5OZwb5EhSo+QryUP59VZD192Wa/Ln8NPj2ebr8EQBA/u0mhPyz9N79YEaY/e74xP4zAuL3fusk/DHeCP3NlhD9uR/i+byEBwAsng78Oh6C/kz+EPmDbQz4CaGM/3VMyvvxgBj9bL5i/dz6Pv4c65L1zG6K/rCGHvwFe/r5vJQC/AxEgwDUWzD5dWQw+Az+tv0WIoj7C3q4+pwCpPrDqEz+QO1k/JEmZvw+lBT90VZw/4OJ5P+Ifur8YrfQ+vRM7vsabWL6z8fe+mDj8PrKLrb7GRk4/bZKnP174ZT/qLwI/CxnYP7ezkD8XPjW+TO0GwPu3Cb88Trq+qR8WQMCBKL/FvhK/arG1vqqCIL4adyI/qKmhPhjlITzXGFe/5Ke+Phj27TtLEAVAv8CgvmYrUb+xWq4/ISWKv0mTrL/40ts+SLWAvmzwED/X7RA/",
            "60eMP7eeXT/UT+S/pmnBP2dVzD38pgw/r6EYP8YxgL+yDaE+f9k8P7rgvL/kAWs/SAZyv4WKTL9bBZA/vEX1P71eWj8xgTS/MVqhv1G2yT6abAC/QBNlv44rSz9+XIY/dAkLPsFLOT/2SL4/sjcFwGzmEj+ybU8+1u6gv3GcvT86q768D6YCwL5Pzj9RjoC+f27/v5x4ur+xxCg+qu+UPiIsNT8VLSTAicGqvxukBL/nSZ6/KvgUwH/bYj8C+G2/YnaWvX5Yhr8K2SI/nSDbP2D8qT+Eaku/QZ8Xv6bZm7/hdV0/QZ/RPl2vBj/2GP4+5a8XvxwJg79/5Z4+MibdvqQ9174J3bY/6IyjPgXZBUBQiElAjSo/v8JRmL/ocSI/+sKPv8JMPT+mcIi/PHwEv561x79I5ZS/X+NQPwxVYL5ptcy9hswewFTnaj8gT6E+u7qoveWbwL+jR1I/paKAPxEqDcB61Mg+woM8vzbikL6X+5Y/WopMP56Ejb+F3j+8LRDPP6hOGr9XdFg/RN1ZP3Oulz8Dqq8+ZgxcP67R2L/obiG/UYEpP5dF3j04mWS/orQVP/14OD7DRtm/eJzEvA6wL79oVdS+Sgg8v691DUA7NkE/Xx2MPotviD7XqUi+VDw9PuswYb4hT00/mjjEPo8k4L5Jtg8/jFpHP4t6Mz8fHSc//YRavlMjzj7kaji+3UR5vyvq474KKhW/L/eMvwQtLb9Rv5e+B8yGv5elX7806z8/aarbvn+C2r6RxnO/HkPCPvqJJL8Cp7o97YjmPhVT2D0+G1m+HNtLPVMVSj+cpVs/E9WkPsJjCEANkgU/fmYyv6TaD79i1Wu/apYcv8glkj7DdL8/CIDmv+PPKT9qylK+X+S+Pme1wD4SqGS+wwV0P9rTSL8vkWu/kL85v1j0Qr+/1fY+jk+ev7nnLz8h7kM/7wmRvxcyuj4A44w/dn/8v9U/wD/XCSy/rEmPvgNajT7SYMm/Bp4bv6VvOb5fLZm/yRaGviyvTb9Tuwy/",
            "TvznvSH0gL8dft88oGCHv8peij0Nz6w+2QD/vswg3r5kczM/CzZoPxYFYD+C0AI/gGxIPvUwOz9O/kNAT9IXPkIPdz+ewCc/CfcbP4+WOT1/zM+/+gcAQK53ur2NV3W/sPKFvv0mFz8UrHy/scpLPSQmnb9mZig/R6CnPfzsJcA+YBc/4kBPvQ7pKr8vdym+anP0vlKdBT/Gs8g+E3FMPmh0870mk02/40VWP3Ipbz+Rmre/IJJ/P2hWXz+0C5s+kg59P1KvW7+CfPI+lb2qv6q3lT+WcoU/NUfcPxS9Lj9rDLM/Cc4fQKRKrj4A3vg/fDCkPT/xUL4Oe0M/Wl7oPyhajz+Zi0a/ss74Ph5gYD5phUg/BfV5vw9gKr5yeRNAG12YPw6Lob9spIi7H+4RP7x+7r7mtzM+O3xfvIbZBr4spfy+kccoPl6jKrvAAJY/5TmoPwPBiL9y/Vu/sNw8vsX3Ir81VGe/c6XOveldWbsv4TbAU2zYPpbDEz9It8W+4P17vlGTSr+ges09LoGvPlqYyL/RPXc/HMqUvlrD1z3ouLg+YtMGP0jeYL5Qp4Y/eqfFPrwF1j9POYg+lT6SvsD/qzx4IgS/tVhSP+1Qq79csrc/AhovPwfd6T5kNCa+SFViv4NYtb8KQYm/kaIOwKaXTT6uCbE/5/Dpvu8L8j+ZrPY9+SL2PdXP3T4wTI0/eIulvmVTnL5HbJ2/4Pxsvz58zj6wecI97AIvvwSHqb1b1B0/RfBaP+liYD8CyZA9GlIPv2MPp78gNt4/5zwYvz64mD884mA/5FE1QKtKh74t3GS/nb+zP72frT/52ZO/jcuBv6gQjr+2eZE/SGTMPlZ4xL2hQ6M+Su6nvrG+5j4wvyw/NDNrvyGdoz8XBNO/4f0aP1u/JT9cyhA/n4Fnv8XY7D4v9Xi/3rMzP1Udhr9lhkq+51n0PjTjEL8a8pO+8Axpvx9trT1/M6m/MKSAvmE4Mb9olKS/joBpv1VUrb/iSsy+lAOpP9w1Yz8926W9",
